CREATE TABLE `app_user` (
  `id` int(8) NOT NULL auto_increment,
  `username` varchar(20) NOT NULL,
  `version` int(11) NOT NULL,
  `password` varchar(50) default NULL,
  `first_name` varchar(50) default NULL,
  `last_name` varchar(50) default NULL,
  `address` varchar(150) default NULL,
  `city` varchar(50) default NULL,
  `province` varchar(100) default NULL,
  `country` varchar(100) default NULL,
  `postal_code` varchar(15) default NULL,
  `email` varchar(50) default NULL,
  `phone_number` varchar(20) default NULL,
  `website` varchar(255) default NULL,
  `password_hint` varchar(100) default NULL,
  `account_enabled` char(1) default NULL,
  `account_expired` char(1) default NULL,
  `account_locked` char(1) default NULL,
  `credentials_expired` char(1) default NULL,
  PRIMARY KEY  (`id`),
  UNIQUE KEY `username` (`username`),
  UNIQUE KEY `email` (`email`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8;
CREATE TABLE `role` (
  `id` int(8) NOT NULL auto_increment,
  `name` varchar(20) NOT NULL,
  `description` varchar(64) default NULL,
  PRIMARY KEY  (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

CREATE TABLE `user_role` (
  `user_id` int(8) NOT NULL,
  `role_id` int(8) NOT NULL,
  PRIMARY KEY  (`user_id`,`role_id`),
  KEY `FK143BF46A14048CB4` (`role_id`),
  KEY `FK143BF46AF02988D6` (`user_id`),
  CONSTRAINT `FK143BF46A14048CB4` FOREIGN KEY (`role_id`) REFERENCES `role` (`id`),
  CONSTRAINT `FK143BF46AF02988D6` FOREIGN KEY (`user_id`) REFERENCES `app_user` (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8
;
insert into `app_user`(`id`,`username`,`version`,`password`,`first_name`,`last_name`,`address`,`city`,`province`,`country`,`postal_code`,`email`,`phone_number`,`website`,`password_hint`,`account_enabled`,`account_expired`,`account_locked`,`credentials_expired`) values 
(-2,'admin',1,'d033e22ae348aeb5660fc2140aec35850c4da997','Matt','Raible','','Denver','CO','US','80210','matt@raibledesigns.com','','http://raibledesigns.com','Not a female kitty.','1','0','0','0'),
(-1,'user',1,'12dea96fec20593566ab75692c9949596833adc9','Tomcat','User','','Denver','CO','US','80210','matt_raible@yahoo.com','','http://tomcat.apache.org','A male kitty.','1','0','0','0');


insert into `role`(`id`,`name`,`description`) values 
(-2,'ROLE_USER','Default role for all Users'),
(-1,'ROLE_ADMIN','Administrator role (can edit Users)');


insert into `user_role`(`user_id`,`role_id`) values 
(-1,-2),
(-2,-1);




insert into `col_column`(`C_TIME`,`COL_NAME`) values 
('2012-07-03 00:00:00','房产新闻11'),
('2012-07-03 00:00:00','房产新闻12'),
('2012-07-03 00:00:00','房产新闻13'),
('2012-07-03 00:00:00','房产新闻14'),
('2012-07-03 00:00:00','房产新闻15'),
('2012-07-03 00:00:00','房产新闻16'),
('2012-07-03 00:00:00','房产新闻17'),
('2012-07-03 00:00:00','房产新闻18'),
('2012-07-03 00:00:00','房产新闻19'),
('2012-07-03 00:00:00','房产新闻10'),
('2012-07-03 00:00:00','房产新闻21'),
('2012-07-03 00:00:00','房产新闻22'),
('2012-07-03 00:00:00','房产新闻23'),
('2012-07-03 00:00:00','房产新闻24'),
('2012-07-03 00:00:00','房产新闻25'),
('2012-07-03 00:00:00','房产新闻26'),
('2012-07-03 00:00:00','房产新闻27'),
('2012-07-03 00:00:00','房产新闻28'),
('2012-07-03 00:00:00','房产新闻29'),
('2012-07-03 00:00:00','房产新闻20'),
('2012-07-04 00:00:00','商品房买卖');




insert into `con_content`(`NAME_CN`,`SUBMIT_TIME`,`UPDATE_TIME`,`HTML`) values
('内容信息110','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息111','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息112','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息113','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息114','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息115','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息116','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息117','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息118','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息119','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息120','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息121','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息122','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息123','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息124','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息125','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息126','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息127','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息128','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息129','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),


('内容信息210','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息211','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息212','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息213','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息214','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息215','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息216','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息217','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息218','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息219','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息220','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息221','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息222','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息223','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息224','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息225','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息226','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息227','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息228','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息229','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3')


('内容信息310','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息311','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息312','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息313','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息314','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息315','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息316','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息317','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息318','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息319','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息320','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息321','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息322','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息323','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息324','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息325','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息326','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息327','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息328','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息329','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3')


('内容信息410','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息411','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息412','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息413','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息414','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息415','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息416','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息417','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息418','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息419','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息420','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息421','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息422','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息423','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息424','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息425','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息426','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息427','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息428','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息429','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3')


('内容信息110','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息111','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息112','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息113','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息114','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息115','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息116','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息117','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息118','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息119','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息120','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息121','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息122','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息123','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息124','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息125','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息126','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息127','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息128','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息129','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3')


('内容信息110','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息111','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息112','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息113','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息114','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息115','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息116','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息117','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息118','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息119','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息120','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息121','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息122','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息123','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息124','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息125','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息126','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息127','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息128','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3'),
('内容信息129','2012-07-03 00:00:00','2012-07-03 20:00:23','内容信息1<BR/>内容信息2内容信息3');
